In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df = pd.read_csv('height_weight.csv')
df.head()

  gender     height      weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [4]:
df.describe()

             height        weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

**Outlier detection and removal for height in the dataset**

In [6]:
q1 = df.height.quantile(0.25)
q3 = df.height.quantile(0.75)
q1,q3

(63.505620481218955, 69.1742617268347)

In [8]:
IQR = q3-q1
IQR

5.668641245615746

In [9]:
lower_limit = q1 - 1.5*IQR
upper_limit = q3 + 1.5*IQR
lower_limit, upper_limit

(55.00265861279534, 77.67722359525831)

In [10]:
df[(df.height<lower_limit)|(df.height>upper_limit)]

      gender     height      weight
994     Male  78.095867  255.690835
1317    Male  78.462053  227.342565
2014    Male  78.998742  269.989699
3285    Male  78.528210  253.889004
3757    Male  78.621374  245.733783
6624  Female  54.616858   71.393749
7294  Female  54.873728   78.606670
9285  Female  54.263133   64.700127

In [12]:
df_no_outlier = df[(df.height>lower_limit)&(df.height<upper_limit)]
df_no_outlier

      gender     height      weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[9992 rows x 3 columns]

**Outlier detection and removal for weight in dataset**

In [14]:
q1_1 = df.weight.quantile(0.25)
q3_1 = df.weight.quantile(0.75)
q1,q3

(135.8180513055015, 187.16952486868348)

In [15]:
IQR_1 = q3_1 - q1_1
IQR_1

51.35147356318197

In [16]:
lower_limit_1 = q1_1 - 1.5*IQR_1
upper_limit_1 = q3_1 + 1.5*IQR_1
lower_limit_1, upper_limit_1

(58.79084096072856, 264.19673521345646)

In [17]:
df_no_outlier = df[(df.height>lower_limit_1)&(df.height<upper_limit_1)]
df_no_outlier

      gender     height      weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[9820 rows x 3 columns]